import { createStore } from 'vuex'
import Swal from 'sweetalert2'


function updateLocalStorage(cart) {
    localStorage.setItem('cart', JSON.stringify(cart))
}

export default createStore({
  state: {
    cart: localStorage.getItem('cart') ? JSON.parse(localStorage.getItem('cart')) : [],

    Products:[
      {
          pr_id:1,
          title:'گوشی های هوشمند',
          product:[
  
              {
                  id:11,
                  name:'Samsung Galaxy S22',
                  price:40000000,
                  image:'S22.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
              {
                  id:12,
                  name:'Samsung Galaxy S21',
                  price:20000000,
                  image:'samsungs21.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
              {
                  id:13,
                  name:'Samsung Galaxy A52S',
                  price:12000000,
                  image:'a52s.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
          ]
  
      },
      {
          pr_id:2,
          title:'ساعت های هوشمند',
          product:[
              {
                  id:21,
                  name:'ساعت هوشمند شیائومی',
                  price:1000000,
                  image:'Xiaomi.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
              {
                  id:22,
                  name:'ساعت هوشمند سامسونگ',
                  price:10000000,
                  image:'Samsung-watch.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
  
          ]
      },
      {
          pr_id:3,
          title:'یخچال های ساید بای ساید',
          product:[
              {
                  id:31,
                  name:' یخچال ساید بای ساید ال جی',
                  price:100000000,
                  image:'lg-side.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
              {
                  id:32,
                  name:'یخچال ساید بای ساید سامسونگ',
                  price:120000000,
                  image:'Samsung-side.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
          ]
  
      },
      {
          pr_id:4,
          title:'تلویزیون',
          product:[
              {
                  id:41,
                  name:'تلویزیون ال ای دی سامسونگ',
                  price:50000000,
                  image:'samsungtv.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                   
              },
              {
                  id:42,
                  name:'تلویزیون ال جی',
                  price:60000000,
                  image:'lgtv.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
          ]
      },
      {
          pr_id:5,
          title:'لباسشویی',
          product:[
              {
                  id:51,
                  name:'لباسشویی ال جی',
                  price:15000000,
                  image:'lgwash.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
              {
                  id:52,
                  name:'لباسشویی سامسونگ',
                  price:20000000,
                  image:'samsunglebas.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
          ]
      }
  ],

  products:[
    {
        id:11,
        name:'Samsung Galaxy S22',
        price:40000000,
        image:'S22.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'کره جنوبی' ,
        colors:['زرد','آبی'],
    },
    {
        id:12,
        name:'Samsung Galaxy S21',
        price:20000000,
        image:'samsungs21.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'کره جنوبی' ,
        colors:['زرد','آبی'],
           },
    {
        id:13,
        name:'Samsung Galaxy A52S',
        price:12000000,
        image:'a52s.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'کره جنوبی' ,
        colors:['زرد','آبی'],
       
    },
    {
        id:21,
        name:'ساعت هوشمند شیائومی',
        price:1000000,
        image:'Xiaomi.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'چین',
        colors:['زرد','آبی'],
            },
    {
        id:22,
        name:'ساعت هوشمند سامسونگ',
        price:10000000,
        image:'Samsung-watch.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'کره جنوبی' ,
        colors:['زرد','آبی'],
           },
    {
        id:31,
        name:' یخچال ساید بای ساید ال جی',
        price:100000000,
        image:'lg-side.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'ژاپن' ,
        colors:['زرد','آبی'],
           },
    {
        id:32,
        name:'یخچال ساید بای ساید سامسونگ',
        price:120000000,
        image:'Samsung-side.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'کره جنوبی' ,
        colors:['زرد','آبی'],
            },
    {
        id:41,
        name:'تلویزیون ال ای دی سامسونگ',
        price:50000000,
        image:'samsungtv.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'کره جنوبی' ,
        colors:['زرد','آبی'],

            },
    {
        id:42,
        name:'تلویزیون ال جی',
        price:60000000,
        image:'lgtv.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'ژاپن' ,
        colors:['زرد','آبی'],
           },
    {
        id:51,
        name:'لباسشویی ال جی',
        price:15000000,
        image:'lgwash.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'ژاپن',
        colors:['زرد','آبی'],
           },
    {
        id:52,
        name:'لباسشویی سامسونگ',
        price:20000000,
        image:'samsunglebas.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'کره جنوبی' ,
        colors:['زرد','آبی'],
           },
],

Representatives:[
    {
        re_id:1,
        title:'نمایندگان شهر تهران',
        represent:[
            {
                id:11,
                address:' خیابان انقلاب',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'
                

            },
            {
                id:12,
                address:' خیابان ۷تیر',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'
                
            },
            {
                id:13,
                address:' خیابان منیریه',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'
                
            }
        ]
    },
    {
        re_id:2,
        title:'نمایندگان شهر اصفهان',
        represent:[
            {
                id:21,
                address:' خیابان امام',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'

            },
            {
                id:22,
                address:' خیابان ۷تیر',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'
                
            },
         
        ]
    },
    {
        re_id:3,
        title:'نمایندگان شهر شیراز',
        represent:[
            {
                id:31,
                address:' خیابان شهید بهشتی',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'

            },
            {
                id:32,
                address:' خیابان حافظ',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'
                
            },
            {
                id:32,
                address:' خیابان حافظ',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'
                
            },
        
         
        ]
    },
    {
        re_id:4,
        title:'نمایندگان شهر ارومیه',
        represent:[
            {
                id:41,
                address:' خیابان شهید باهنر',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'

            },
            {
                id:42,
                address:' خیابان سعدی',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'
                
            },
            {
                id:42,
                address:' خیابان خیام جنوبی',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'
                
            },
        
         
        ]
    },
    {
        re_id:5,
        title:'نمایندگان شهر مشهد',
        represent:[
            {
                id:51,
                address:' خیابان امام',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'

            },
            {
                id:52,
                address:' خیابان مولوی',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'
                
            },
            {
                id:53,
                address:' خیابان شهید مطهری',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'
                
            },
            {
                id:54,
                address:' خیابان شهید بهشتی',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'
            },
        
         
        ]
    },
    {
        re_id:6,
        title:'نمایندگان شهر تبریز',
        represent:[
            {
                id:61,
                address:' خیابان امام',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'

            },
            {
                id:62,
                address:' خیابان ستارخان',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'
            },
            {
                id:63,
                address:' خیابان باقرخان',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'
            },
            {
                id:64,
                address:' خیابان شهید بهشتی',
                description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
                image:'image2.png',
                phone:'0123456789'
            },
            
         
        ]
    }

],

representatives:[
    {
        id:11,
        address:' خیابان انقلاب',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'
        

    },
    {
        id:12,
        address:' خیابان ۷تیر',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'
        
    },
    {
        id:13,
        address:' خیابان منیریه',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'
        
    },
    {
        id:21,
        address:' خیابان امام',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'

    },
    {
        id:22,
        address:' خیابان ۷تیر',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'
        
    },
    {
        id:31,
        address:' خیابان شهید بهشتی',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'

    },
    {
        id:32,
        address:' خیابان حافظ',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'
        
    },
    {
        id:32,
        address:' خیابان حافظ',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'
        
    },
    {
        id:41,
        address:' خیابان شهید باهنر',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'

    },
    {
        id:42,
        address:' خیابان سعدی',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'
        
    },
    {
        id:43,
        address:' خیابان خیام جنوبی',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'
        
    },
    {
        id:51,
        address:' خیابان امام',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'

    },
    {
        id:52,
        address:' خیابان مولوی',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'
        
    },
    {
        id:53,
        address:' خیابان شهید مطهری',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'
        
    },
    {
        id:54,
        address:' خیابان شهید بهشتی',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'
    },

    {
        id:61,
        address:' خیابان امام',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'

    },
    {
        id:62,
        address:' خیابان ستارخان',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'
    },
    {
        id:63,
        address:' خیابان باقرخان',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'
    },
    {
        id:64,
        address:' خیابان شهید بهشتی',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        image:'image2.png',
        phone:'0123456789'
    },
    
],

  },
  getters: {
    allProducts(state){
      return state.Products
    },
    getProductById: (state) => (id) => {
        return state.products.find(pr => pr.id == id)
    } ,
    getProductsById:(state)=>(id)=>{
     return state.Products.find(pr=>pr.pr_id==id)
       
    },
    allRepresentatives(state){
        return state.Representatives
    },
    getRepresentById: (state) => (id) => {
        return state.representatives.find(pr => pr.id == id)
    } ,
    getRepresentsById:(state)=>(id)=>{
        return state.Representatives.find(pr=>pr.re_id==id)
    },
    count(state) {
        return state.cart.length
    },
    allItems(state) {
        return state.cart
    },
    totalAmount(state) {
        return state.cart.reduce((total, p) => {
            return total + p.price * p.quantity
        }, 0)
    }
  
  },
  mutations: {
    add(state, product) {
        const item = state.cart.find(p => p.id == product.id)
        if (!item) {
            state.cart.push({
                ...product,
                quantity: 1
            })
        } else {
            item.quantity++
        }
        updateLocalStorage(state.cart)
    },
    increment(state, id) {
        const item = state.cart.find(p => p.id == id)
        if (item) {
            item.quantity++
        }
        updateLocalStorage(state.cart)
    },
    decrement(state, id) {
        const item = state.cart.find(p => p.id == id)
        if (item) {
            if (item.quantity > 1) {
                item.quantity--
            }
        }
        updateLocalStorage(state.cart)
    },
    remove(state, id) {
        state.cart = state.cart.filter(cart => cart.id != id)
        updateLocalStorage(state.cart)
    },
    clear(state) {
        state.cart = []
        updateLocalStorage(state.cart)
    }
  },
  actions: {
    addToCart({ commit }, product) {
        commit('add', product);
        Swal.fire({
            title: "محصول اضافه شد",
            icon: "success",
            showConfirmButton: false,
            timerProgressBar: true,
            timer: 3000,
            toast: true,
            position: 'top',
        });
    },
    increment({ commit }, id) {
        commit('increment', id);
        Swal.fire({
            title: "محصول اضافه شد",
            icon: "success",
            showConfirmButton: false,
            timerProgressBar: true,
            timer: 3000,
            toast: true,
            position: 'top',
        });
    },
    decrement({ commit }, id) {
        commit('decrement', id);
        Swal.fire({
            title: "محصول کم شد",
            icon: "success",
            showConfirmButton: false,
            timerProgressBar: true,
            timer: 3000,
            toast: true,
            position: 'top',
        });
    },
    remove({ commit }, id) {
        commit('remove', id);
        Swal.fire({
            title: "محصول حذف شد",
            icon: "warning",
            showConfirmButton: false,
            timerProgressBar: true,
            timer: 3000,
            toast: true,
            position: 'top',
        });
    },
    clear({ commit }) {
        commit('clear');
        Swal.fire({
            title: "سبد خرید پاک شد",
            icon: "warning",
            showConfirmButton: false,
            timerProgressBar: true,
            timer: 3000,
            toast: true,
            position: 'top',
        });
    }
},
  modules: {
  }
})
