import { createStore } from 'vuex'

export default createStore({
  state: {
    Products:[
      {
          pr_id:1,
          title:'گوشی های هوشمند',
          product:[
  
              {
                  id:11,
                  name:'Samsung Galaxy S22',
                  price:40000000,
                  image:'S22.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
              {
                  id:12,
                  name:'Samsung Galaxy S21',
                  price:20000000,
                  image:'samsungs21.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
              {
                  id:13,
                  name:'Samsung Galaxy A52S',
                  price:12000000,
                  image:'a52s.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
          ]
  
      },
      {
          pr_id:2,
          title:'ساعت های هوشمند',
          product:[
              {
                  id:21,
                  name:'ساعت هوشمند شیائومی',
                  price:1000000,
                  image:'Xiaomi.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
              {
                  id:22,
                  name:'ساعت هوشمند سامسونگ',
                  price:10000000,
                  image:'Samsung-watch.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
  
          ]
      },
      {
          pr_id:3,
          title:'یخچال های ساید بای ساید',
          product:[
              {
                  id:31,
                  name:' یخچال ساید بای ساید ال جی',
                  price:100000000,
                  image:'lg-side.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
              {
                  id:32,
                  name:'یخچال ساید بای ساید سامسونگ',
                  price:120000000,
                  image:'Samsung-side.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
          ]
  
      },
      {
          pr_id:4,
          title:'تلویزیون',
          product:[
              {
                  id:41,
                  name:'تلویزیون ال ای دی سامسونگ',
                  price:50000000,
                  image:'samsungtv.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                   
              },
              {
                  id:42,
                  name:'تلویزیون ال جی',
                  price:60000000,
                  image:'lgtv.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
          ]
      },
      {
          pr_id:5,
          title:'لباسشویی',
          product:[
              {
                  id:51,
                  name:'لباسشویی ال جی',
                  price:15000000,
                  image:'lgwash.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
              {
                  id:52,
                  name:'لباسشویی سامسونگ',
                  price:20000000,
                  image:'samsunglebas.png',
                  description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',                  
              },
          ]
      }
  ],
  products:[
    {
        id:11,
        name:'Samsung Galaxy S22',
        price:40000000,
        image:'S22.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'کره جنوبی' ,
        colors:['زرد','آبی'],
    },
    {
        id:12,
        name:'Samsung Galaxy S21',
        price:20000000,
        image:'samsungs21.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'کره جنوبی' ,
        colors:['زرد','آبی'],
           },
    {
        id:13,
        name:'Samsung Galaxy A52S',
        price:12000000,
        image:'a52s.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'کره جنوبی' ,
        colors:['زرد','آبی'],
       
    },
    {
        id:21,
        name:'ساعت هوشمند شیائومی',
        price:1000000,
        image:'Xiaomi.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'چین',
        colors:['زرد','آبی'],
            },
    {
        id:22,
        name:'ساعت هوشمند سامسونگ',
        price:10000000,
        image:'Samsung-watch.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'کره جنوبی' ,
        colors:['زرد','آبی'],
           },
    {
        id:31,
        name:' یخچال ساید بای ساید ال جی',
        price:100000000,
        image:'lg-side.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'ژاپن' ,
        colors:['زرد','آبی'],
           },
    {
        id:32,
        name:'یخچال ساید بای ساید سامسونگ',
        price:120000000,
        image:'Samsung-side.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'کره جنوبی' ,
        colors:['زرد','آبی'],
            },
    {
        id:41,
        name:'تلویزیون ال ای دی سامسونگ',
        price:50000000,
        image:'samsungtv.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'کره جنوبی' ,
        colors:['زرد','آبی'],

            },
    {
        id:42,
        name:'تلویزیون ال جی',
        price:60000000,
        image:'lgtv.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'ژاپن' ,
        colors:['زرد','آبی'],
           },
    {
        id:51,
        name:'لباسشویی ال جی',
        price:15000000,
        image:'lgwash.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'ژاپن',
        colors:['زرد','آبی'],
           },
    {
        id:52,
        name:'لباسشویی سامسونگ',
        price:20000000,
        image:'samsunglebas.png',
        description:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
        country:'کره جنوبی' ,
        colors:['زرد','آبی'],
           },
]
  },
  getters: {
    allProducts(state){
      return state.Products
    },
    getProductById: (state) => (id) => {
        return state.products.find(pr => pr.id == id)
    } ,
    getProductsById:(state)=>(id)=>{
        return state.Products.find(pr=>pr.pr_id==id)
    }
  
  },
  mutations: {
  },
  actions: {
  },
  modules: {
  }
})
